# Two simple functions banner() & clear() pretty self explanatory

from termcolor import colored
import os

def banner():
    banner = '''
███████████   ███  ████            █████    ██████   █████           █████   
░░███░░░░░███ ░░░  ░░███           ░░███    ░░██████ ░░███           ░░███    
 ░███    ░███ ████  ░███   ██████  ███████   ░███░███ ░███   ██████  ███████  
 ░██████████ ░░███  ░███  ███░░███░░░███░    ░███░░███░███  ███░░███░░░███░   
 ░███░░░░░░   ░███  ░███ ░███ ░███  ░███     ░███ ░░██████ ░███████   ░███    
 ░███         ░███  ░███ ░███ ░███  ░███ ███ ░███  ░░█████ ░███░░░    ░███ ███
 █████        █████ █████░░██████   ░░█████  █████  ░░█████░░██████   ░░█████ 
░░░░░        ░░░░░ ░░░░░  ░░░░░░     ░░░░░  ░░░░░    ░░░░░  ░░░░░░     ░░░░░
                    https://arxiv.org/pdf/1704.07911.pdf
    '''

    print(colored(banner, 'green'))

def clear(print_banner=True):
    command = {
        'nt': 'cls',
        'darwin': 'clear',
        'posix': 'clear'
    }
    if os.name in command.keys():
        os.system(command[os.name])
    else: error('Unsupported operating system. Open an issue at https://github.com/vishalkrishnads/pilotnet/issues')
    if print_banner:
        banner()

def message(text, mode='success'):
    color = {
        'success': 'green',
        'warn': 'yellow',
        'error': 'red'
    }
    print(f'{colored("*", color[mode])} {text}')

def warn(text):
    message(text, mode='warn')

def error(text):
    message(text, mode='error')